{
  "backend/main.mo": "Motoko backend actor managing products, orders, users, carts, wishlist, ratings, and secure one-time admin bootstrap with access control and storage mixins.",
  "feature_evidence.json": "Feature evidence report describing a UI fix related to mobile bottom navigation overlap in AppShell.",
  "frontend-file-summaries.txt": "Pre-generated mapping of frontend file paths to short functional summaries used for build reference.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables and dark mode tokens for the app theme.",
  "frontend/index.html": "Base HTML document with root mount point and script loading the React application.",
  "frontend/src/App.tsx": "Main router configuration wiring all user, catalog, support, and admin pages under the AppShell layout.",
  "frontend/src/components/admin/AdminGuard.tsx": "Pass-through wrapper that renders children without enforcing admin authentication.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with automatic retry and React Query cache reset.",
  "frontend/src/components/auth/RequireAuth.tsx": "Authentication gate that shows a sign-in card when unauthenticated and renders children otherwise.",
  "frontend/src/components/home/BannerCarousel.tsx": "Auto-rotating banner carousel displaying simple gradient slides with looped navigation.",
  "frontend/src/components/home/HomeSearchBar.tsx": "Debounced search bar with popover results for products and categories, navigating to selected items.",
  "frontend/src/components/layout/AppShell.tsx": "Main layout wrapper rendering header, content outlet, mobile nav, and a profile setup modal if the user is authenticated but missing a profile.",
  "frontend/src/components/layout/BrandHeader.tsx": "Top navigation bar with logo, search, cart count, user account actions, and a mobile slide-out menu.",
  "frontend/src/components/layout/MobileBottomNav.tsx": "Mobile-only bottom navigation bar linking to catalog, cart, and account with active-state highlighting.",
  "frontend/src/components/product/ProductCard.tsx": "Displays product image, details, rating, and supports adding items to cart or wishlist with identity checks.",
  "frontend/src/components/product/ProductSection.tsx": "Horizontally scrollable product section that renders a titled row of ProductCard components.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter basic profile information and save it via mutation.",
  "frontend/src/docs/admin-activation-flow.md": "Documentation describing the admin activation process, backend behavior, error mapping, and testing notes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useAdminActivation.ts": "Mutation hook to activate admin access using a validated 4‑digit code and refresh role-related queries.",
  "frontend/src/hooks/useBootstrapAdmin.ts": "Alias hook that forwards to useAdminActivation for consistent admin activation flow.",
  "frontend/src/hooks/useCallerPrincipal.ts": "Query hook fetching the caller’s principal from the backend when an actor and identity are available.",
  "frontend/src/hooks/useCurrentUserRole.ts": "Query hook retrieving the caller's role and exposing convenience booleans for role checks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating products, categories, cart data, ratings, profiles, and orders via the backend actor.",
  "frontend/src/index.css": "Configures Tailwind CSS base styles and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/account/AccountLoginPage.tsx": "Login page using Internet Identity; redirects authenticated users and provides sign‑in UI with info cards.",
  "frontend/src/pages/account/AccountPage.tsx": "Account hub showing sign‑in status, authentication controls, and navigation to profile, orders, and wishlist.",
  "frontend/src/pages/admin/AdminActivatePage.tsx": "Activation screen that auto‑redirects to the admin dashboard after a short delay.",
  "frontend/src/pages/admin/AdminAnalyticsPage.tsx": "Admin analytics view computing basic sales metrics, recent orders, and top products with admin access guard.",
  "frontend/src/pages/admin/AdminCustomersPage.tsx": "Admin customers page displaying info about customer identity being managed via Internet Identity.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Main admin dashboard listing navigable sections like products, orders, customers, analytics, and support.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin interface for viewing, filtering, and updating order statuses with guarded access.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Provides an admin interface to list products, add new products with images, and create categories using dialogs and mutations.",
  "frontend/src/pages/admin/AdminSupportTicketsPage.tsx": "Displays a guarded admin page explaining that support tickets use a demo local‑storage system and would be on‑chain in production.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart, showing items, totals, and actions to remove items or clear the cart.",
  "frontend/src/pages/CatalogPage.tsx": "Displays product listings with category, price, and sorting filters, supporting search-driven results.",
  "frontend/src/pages/CheckoutPage.tsx": "Implements a multi-step checkout flow including address entry, payment selection, and order placement.",
  "frontend/src/pages/HomePage.tsx": "Homepage that fetches products, categories, and best‑selling items to render hero, categories, product sections, and a CTA.",
  "frontend/src/pages/NotificationsPage.tsx": "Protected page showing a placeholder card indicating no notifications available.",
  "frontend/src/pages/OrderDetailPage.tsx": "Protected page that loads an order, displays its tracking, items, and allows invoice download.",
  "frontend/src/pages/OrdersPage.tsx": "Protected page listing user orders sorted by date with navigation to individual order details.",
  "frontend/src/pages/ProductDetailPage.tsx": "Page showing detailed product info, image, rating, and actions for cart, wishlist, checkout, and submitting ratings.",
  "frontend/src/pages/ProfilePage.tsx": "Protected page where users view and edit their personal profile information.",
  "frontend/src/pages/support/FaqPage.tsx": "Renders a FAQ page with an accordion of common questions and a card linking to the support tickets page.",
  "frontend/src/pages/support/SupportTicketDetailPage.tsx": "Shows a protected detail view for an individual support ticket based on its ID.",
  "frontend/src/pages/support/SupportTicketsPage.tsx": "Implements a user‑side support ticket list with local creation via a dialog and navigation to ticket details.",
  "frontend/src/pages/WishlistPage.tsx": "Protected page showing wishlist items mapped to product data or an empty-state message.",
  "frontend/src/utils/extractBackendErrorMessage.ts": "Utility to extract readable messages from varied backend error shapes, including nested IC error formats.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL params, persisting them in sessionStorage, and managing hash‑based query values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, animations, plugins, and container settings.",
  "project_state.json": "Metadata describing the project state, known issues, and existing feature requirements for bottom‑of‑page visibility."
}