{
  "backend/main.mo": "Primary backend canister implementing storage, access control, products, users, carts, orders, and credentials with role-based logic and admin bootstrap.",
  "backend/migration.mo": "Stub migration module that returns the provided state unchanged.",
  "feature_evidence.json": "Feature evidence report listing affected frontend files, components, and test IDs for auth-related feature changes.",
  "frontend-file-summaries.txt": "Prewritten summaries describing various frontend components, pages, and styling updates across the app.",
  "frontend/index.css": "Global Tailwind base styles defining OKLCH color tokens for light and dark themes.",
  "frontend/index.html": "App HTML entry point mounting the root React element and loading the main script.",
  "frontend/src/App.tsx": "Main router configuration defining all app routes including account, admin, support, and commerce pages.",
  "frontend/src/components/admin/AdminGuard.tsx": "Simple passthrough wrapper that performs no admin authentication checks.",
  "frontend/src/components/auth/LoginButton.tsx": "Sign-in/sign-out button using backend session state and navigating to signup when unauthenticated.",
  "frontend/src/components/auth/RequireAuth.tsx": "Auth gate that allows access for signed‑in or guest users and otherwise shows a sign‑in/guest prompt.",
  "frontend/src/components/home/BannerCarousel.tsx": "Auto-rotating banner carousel with looping slides and gold gradient backgrounds.",
  "frontend/src/components/home/HomeSearchBar.tsx": "Search bar with debounced queries that fetches matching products and categories and navigates on selection.",
  "frontend/src/components/layout/AppShell.tsx": "Main app layout with header, footer, guest notice, profile setup modal, and routed content area.",
  "frontend/src/components/layout/BrandHeader.tsx": "Top navigation bar with logo, search, cart, account actions, and mobile menu.",
  "frontend/src/components/layout/MobileBottomNav.tsx": "Mobile bottom navigation bar linking to catalog, cart, and account with active state highlighting.",
  "frontend/src/components/product/ProductCard.tsx": "Product display card with image, rating, price, and actions to add to cart or wishlist.",
  "frontend/src/components/product/ProductSection.tsx": "Horizontally scrollable section rendering a titled list of product cards.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal prompting new users to enter basic profile details and save them.",
  "frontend/src/docs/admin-activation-flow.md": "Documentation describing the admin activation flow, backend behavior, errors, and UI mappings.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity, recreating it on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useAdminActivation.ts": "Provides a mutation to validate a 4‑digit activation code and call bootstrapAdmin, then refresh admin-related queries.",
  "frontend/src/hooks/useAuthSession.ts": "Derives signed‑in state from backend user role unless guest mode is enabled.",
  "frontend/src/hooks/useBootstrapAdmin.ts": "Thin alias that re-exports useAdminActivation for consistent admin activation flow.",
  "frontend/src/hooks/useCallerPrincipal.ts": "Fetches the caller's principal from the backend once an actor and identity are available.",
  "frontend/src/hooks/useCallerUserProfileSafe.ts": "Safely fetches the caller's user profile only when signed in and an actor is ready.",
  "frontend/src/hooks/useCurrentUserRole.ts": "Retrieves the caller's backend role and exposes convenience flags for guest, user, and admin states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity state, login, and logout via React context, loading and managing AuthClient identities.",
  "frontend/src/hooks/useQueries.ts": "Contains data and mutation hooks for categories, products, ratings, cart, and other backend features using the actor.",
  "frontend/src/index.css": "Defines base Tailwind layers and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the app by mounting React with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/account/AccountLoginPage.tsx": "Provides login entry with options to sign up or continue as guest, redirecting if already signed in.",
  "frontend/src/pages/account/AccountPage.tsx": "Account hub where users sign in, sign out, enter guest mode, and access profile, orders, or wishlist.",
  "frontend/src/pages/account/AccountSignupPage.tsx": "Handles creating username/password credentials with validation, hashing, and redirect on success.",
  "frontend/src/pages/admin/AdminActivatePage.tsx": "Shows admin activation notice and auto‑redirects users to the admin dashboard.",
  "frontend/src/pages/admin/AdminAnalyticsPage.tsx": "Displays admin sales analytics including totals, averages, recent orders, and top products using order and product query hooks.",
  "frontend/src/pages/admin/AdminCustomersPage.tsx": "Shows a customer info page with an alert explaining on-chain customer data handling, protected by AdminGuard.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Renders the admin dashboard with navigation cards linking to product, order, customer, analytics, and support sections.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Provides order management with filtering, status updates, and a table of orders fetched from backend queries.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Allows admins to view products and create new products or categories via dialogs, including image upload handling.",
  "frontend/src/pages/admin/AdminSupportTicketsPage.tsx": "Displays a placeholder alert describing the demo support ticket system, protected by AdminGuard.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart page, loading cart data, mapping products, and providing item removal and checkout actions.",
  "frontend/src/pages/CatalogPage.tsx": "Displays product catalog with category, price, and sort filters, supporting search and mobile/desktop filter UIs.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout steps including address, payment, cart review, and order placement with profile saving.",
  "frontend/src/pages/HomePage.tsx": "Renders homepage with hero, categories, product sections, search bar, and featured/trending/recommended items.",
  "frontend/src/pages/NotificationsPage.tsx": "Shows a protected notifications page with placeholder text when no notifications exist.",
  "frontend/src/pages/OrderDetailPage.tsx": "Displays detailed order info with item breakdown, tracking status, and invoice download.",
  "frontend/src/pages/OrdersPage.tsx": "Lists user orders sorted by date with navigation to individual order details and empty-state handling.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays product details, image, cart/wishlist actions, and rating submission with authentication checks.",
  "frontend/src/pages/ProfilePage.tsx": "Shows and updates the signed‑in user's profile with editable personal info.",
  "frontend/src/pages/support/FaqPage.tsx": "Shows a FAQ list with expandable answers and a link to contact support.",
  "frontend/src/pages/support/SupportTicketDetailPage.tsx": "Displays details for a single support ticket using a ticketId param, protected by authentication.",
  "frontend/src/pages/support/SupportTicketsPage.tsx": "Enables users to create and view local support tickets with a dialog form, requiring authentication.",
  "frontend/src/pages/WishlistPage.tsx": "Loads the user's wishlist and displays matching products or an empty state with navigation options.",
  "frontend/src/utils/extractBackendErrorMessage.ts": "Extracts message strings from various backend error shapes, including nested objects and stringified patterns.",
  "frontend/src/utils/guestSession.ts": "Manages guest-mode state using sessionStorage with helpers to check, enable, and clear it.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, store them in sessionStorage, persist them, and manipulate hash parameters.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme extensions, colors, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Tracks project state and requirements focusing on removing Internet Identity usage and enabling pure username/password authentication."
}