{
  "backend/main.mo": "Main canister implementing products, orders, users, auth, roles, merchant config, and storage with access control mixins.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Plain-text mapping of frontend file paths to short functional descriptions for build planning.",
  "frontend/index.css": "Tailwind base layer defining OKLCH theme tokens for light and dark modes with global styling.",
  "frontend/index.html": "Basic HTML shell mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Application router configuring all public, account, and admin routes wrapped in AppShell.",
  "frontend/src/components/admin/AdminGuard.tsx": "Wrapper component checking admin status and showing loading or access-denied UI before rendering children.",
  "frontend/src/components/auth/EmailCodeSignInFlow.tsx": "Implements a multi-step email, code, and user-details sign‑in flow with validation and simulated loading. Manages state transitions, error handling, and session setup placeholders.",
  "frontend/src/components/auth/InAppBrowserBlocker.tsx": "Detects in-app browsers and blocks sign-in, offering options to open externally or copy the link. Displays warnings and instructions for secure authentication.",
  "frontend/src/components/auth/LoginButton.tsx": "Shows a login/logout button that either navigates to login or clears sessions and signs out. Uses auth session state to toggle behavior and UI.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps protected content, allowing access if signed in or in guest mode, otherwise showing sign-in or guest options. Handles loading and displays guest notices.",
  "frontend/src/components/checkout/UpiPaymentPanel.tsx": "Displays a UPI payment UI with QR code, deep‑link handling, config overrides, and copy‑to‑clipboard actions. Shows fallback notices when merchant config is missing.",
  "frontend/src/components/home/BannerCarousel.tsx": "Auto-advancing looping carousel showing simple gradient banners. Uses a ref to trigger timed slide transitions.",
  "frontend/src/components/home/HomeSearchBar.tsx": "Provides a debounced search bar with popover results for products and categories. Allows selecting results to navigate to product or filtered catalog pages.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main app layout with header, footer, routed content, and bottom nav, showing guest warnings and triggering profile setup when needed.",
  "frontend/src/components/layout/BrandHeader.tsx": "Responsive header with logo, search, cart count, account access, and mobile menu using sheet UI.",
  "frontend/src/components/layout/MobileBottomNav.tsx": "Bottom navigation bar for mobile with links to catalog, cart, and account, highlighting the active route.",
  "frontend/src/components/product/ProductCard.tsx": "Displays product image, details, rating, and provides add‑to‑cart and wishlist actions with auth checks.",
  "frontend/src/components/product/ProductSection.tsx": "Horizontally scrollable section rendering a titled list of ProductCard components.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal form for creating a user profile with name, email, and phone, submitting via a saveProfile mutation.",
  "frontend/src/constants/auth.ts": "Defines minimum password and username lengths for client-side validation.",
  "frontend/src/constants/upi.ts": "Provides UPI merchant constants and utilities to build UPI deep links and retrieve QR code paths.",
  "frontend/src/docs/admin-activation-flow.md": "Documentation describing the admin activation process, error handling, and related backend behavior.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity, auto‑invalidating dependent queries on change.",
  "frontend/src/hooks/useAdminActivation.ts": "Mutation hook validating a 4‑digit activation code and invoking backend admin bootstrap with query refresh.",
  "frontend/src/hooks/useAuthSession.ts": "Combines session auth, guest mode, and Internet Identity to compute signed‑in state and user role.",
  "frontend/src/hooks/useBootstrapAdmin.ts": "Simple wrapper re-exporting useAdminActivation for consistent admin activation flow.",
  "frontend/src/hooks/useCallerPrincipal.ts": "Queries the backend for the caller’s Principal when an actor and identity are available.",
  "frontend/src/hooks/useCallerUserProfileSafe.ts": "Safely fetches the signed‑in user’s profile only when authentication indicates a non‑guest user.",
  "frontend/src/hooks/useCurrentUserRole.ts": "Retrieves the caller’s role from the backend and provides helper flags for guest, user, and admin.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, identity loading, and status handling via a React context provider.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating products, categories, cart data, ratings, and more using the actor API.",
  "frontend/src/index.css": "Tailwind base/styles plus CSS variables for theming in light and dark modes.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/account/AccountLoginPage.tsx": "Provides email code sign‑in and an option to continue as guest, blocking in‑app browsers when detected.",
  "frontend/src/pages/account/AccountPage.tsx": "Manages account state with options to sign in, sign out, continue as guest, and access profile or orders.",
  "frontend/src/pages/account/AccountSignupPage.tsx": "Handles username/password account creation with validation, hashing simulation, and redirect on success.",
  "frontend/src/pages/admin/AdminActivatePage.tsx": "Brief activation page that auto‑redirects users to the admin dashboard.",
  "frontend/src/pages/admin/AdminAnalyticsPage.tsx": "Displays sales, orders, product stats, and recent order summaries for admins.",
  "frontend/src/pages/admin/AdminCustomersPage.tsx": "Shows an admin-only informational page about customer data stored and managed on‑chain.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Renders the admin dashboard with navigation cards for products, orders, customers, analytics, support, and UPI settings.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Displays a filterable orders table with status update controls and loading states for admins.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Provides product and category management, including dialogs to add new products with images and new categories.",
  "frontend/src/pages/admin/AdminSupportTicketsPage.tsx": "Shows a placeholder alert explaining the demo support ticket system implementation.",
  "frontend/src/pages/admin/AdminUpiConfigPage.tsx": "Allows admins to view and update UPI merchant configuration with form validation and backend persistence.",
  "frontend/src/pages/CartPage.tsx": "Displays and manages the user’s shopping cart with item removal, clearing, totals, and checkout navigation.",
  "frontend/src/pages/CatalogPage.tsx": "Product catalog with searching, filtering, sorting, category selection, and responsive filter UI.",
  "frontend/src/pages/CheckoutPage.tsx": "Implements a multi-step checkout flow handling address, payment, and order placement using cart and profile data.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with hero banner, search, categories, and featured product sections populated via product queries.",
  "frontend/src/pages/NotificationsPage.tsx": "Shows an authenticated notifications page with an empty-state message and placeholder card.",
  "frontend/src/pages/OrderDetailPage.tsx": "Fetches and displays detailed order info with tracking steps and invoice download support.",
  "frontend/src/pages/OrdersPage.tsx": "Lists user orders sorted by date with navigation to individual order details and empty-state handling.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows product details, image, cart/wishlist actions, and rating submission with auth checks.",
  "frontend/src/pages/ProfilePage.tsx": "Displays and edits the authenticated user's profile using form fields and save mutations.",
  "frontend/src/pages/support/FaqPage.tsx": "Displays a list of FAQs with accordion UI and a link to create support tickets.",
  "frontend/src/pages/support/SupportTicketDetailPage.tsx": "Shows basic details for a selected support ticket with authenticated access.",
  "frontend/src/pages/support/SupportTicketsPage.tsx": "Implements local support ticket creation and listing with a modal form and navigation to ticket details.",
  "frontend/src/pages/WishlistPage.tsx": "Shows the user's wishlist by mapping stored product IDs to product data and rendering product cards.",
  "frontend/src/utils/copyToClipboard.ts": "Provides clipboard copy using the modern API with a textarea fallback, returning success as a boolean.",
  "frontend/src/utils/detectInAppBrowser.ts": "Detects common in‑app browsers from the user agent and returns a readable browser name.",
  "frontend/src/utils/extractBackendErrorMessage.ts": "Extracts meaningful error messages from various backend error shapes, including nested or stringified structures.",
  "frontend/src/utils/guestSession.ts": "Manages guest mode state in sessionStorage with methods to check, enable, and clear the flag.",
  "frontend/src/utils/openExternalBrowser.ts": "Attempts to open the current URL in a new tab/window to trigger external browser handling, returning success as a boolean.",
  "frontend/src/utils/simpleAuthSession.ts": "Stores and retrieves simple session‑based auth method and identifiers, with helpers for sign‑in status and clearing state.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL and hash parameters, persisting them in sessionStorage, and clearing stored values.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, layout, animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Defines the project state, including requirements for an email sign‑in flow with simulated verification and profile data collection."
}