{
  "backend/main.mo": "Main Motoko canister implementing products, orders, users, cart, wishlist, ratings, merchant config, and credential management with access control and storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to impacted frontend files, components, and test IDs for recent auth and UI workflow updates.",
  "frontend-file-summaries.txt": "Prewritten summaries describing various frontend components, pages, and styling updates across the app.",
  "frontend/index.css": "Tailwind base layer defining OKLCH-driven theme tokens for light/dark mode and applying global background and text styles.",
  "frontend/index.html": "Basic HTML entry point that loads the React app and sets the favicon and page metadata.",
  "frontend/src/App.tsx": "Main routing configuration for all public, account, support, and admin pages using TanStack Router inside the app shell.",
  "frontend/src/components/admin/AdminGuard.tsx": "Admin-only wrapper that checks admin status, shows loading or access denied states, and renders children for authorized users.",
  "frontend/src/components/auth/InAppBrowserBlocker.tsx": "Component detecting in-app browsers and blocking sign-in, offering external browser redirect and link copy options with user guidance.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders a login/logout button that navigates to login or clears sessions on sign-out.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps protected content, handling guest mode, loading states, and prompting for sign-in.",
  "frontend/src/components/checkout/UpiPaymentPanel.tsx": "Displays UPI payment QR, deep link, and copy-to-clipboard with merchant config fallback.",
  "frontend/src/components/home/BannerCarousel.tsx": "Auto‑advancing banner carousel with looping slides.",
  "frontend/src/components/home/HomeSearchBar.tsx": "Search bar with debounced queries showing product and category suggestions and navigation.",
  "frontend/src/components/layout/AppShell.tsx": "Main app layout with header, footer, routing outlet, guest notices, and profile setup modal.",
  "frontend/src/components/layout/BrandHeader.tsx": "Top navigation bar with logo, search, cart, account actions, login button, and mobile menu.",
  "frontend/src/components/layout/MobileBottomNav.tsx": "Bottom mobile navigation bar linking to catalog, cart, and account with active state highlighting.",
  "frontend/src/components/product/ProductCard.tsx": "Displays a product card with image, rating, price, and actions to add to cart or wishlist using backend mutation hooks.",
  "frontend/src/components/product/ProductSection.tsx": "Renders a horizontally scrollable section of ProductCard components under a title.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal form for creating a user profile with name, email, and phone, submitting via a save-profile mutation.",
  "frontend/src/constants/auth.ts": "Defines minimum password and username lengths for authentication validation.",
  "frontend/src/constants/upi.ts": "Provides UPI merchant constants and helpers to build deep links and retrieve the QR code path.",
  "frontend/src/docs/admin-activation-flow.md": "Documentation describing the admin activation flow, validation, backend behavior, and error mapping.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useAdminActivation.ts": "Mutation hook that validates a 4‑digit activation code and calls bootstrapAdmin, then refreshes role state.",
  "frontend/src/hooks/useAuthSession.ts": "Determines signed‑in state from session auth or Internet Identity and returns user role status.",
  "frontend/src/hooks/useBootstrapAdmin.ts": "Simple alias hook that re-exports useAdminActivation.",
  "frontend/src/hooks/useCallerPrincipal.ts": "Fetches the caller's principal from the backend when an actor and identity are available.",
  "frontend/src/hooks/useCallerUserProfileSafe.ts": "Safely fetches the caller’s user profile only when the user is signed in and an actor is ready.",
  "frontend/src/hooks/useCurrentUserRole.ts": "Retrieves and exposes the caller’s role with convenience flags and loading state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing login, logout, and identity state via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as products, categories, cart, ratings, and user profiles.",
  "frontend/src/index.css": "Configures Tailwind layers and defines light/dark theme CSS variables for app-wide styling.",
  "frontend/src/main.tsx": "Initializes the React app root, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/account/AccountLoginPage.tsx": "Implements login UI with Google or phone sign‑in, guest mode, and in‑app browser blocking.",
  "frontend/src/pages/account/AccountPage.tsx": "Displays account overview with sign‑in, guest mode, profile access, and sign‑out actions.",
  "frontend/src/pages/account/AccountSignupPage.tsx": "Provides username/password signup with validation, hashed credential storage, and redirects after creation.",
  "frontend/src/pages/admin/AdminActivatePage.tsx": "Shows admin activation notice and auto‑redirects users to the admin dashboard.",
  "frontend/src/pages/admin/AdminAnalyticsPage.tsx": "Displays analytics metrics including sales, orders, products, and top items for admins.",
  "frontend/src/pages/admin/AdminCustomersPage.tsx": "Shows customer management info noting blockchain‑secured user profiles.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard linking to product, order, customer, analytics, support, and payment settings sections.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin UI for viewing, filtering, and updating order statuses using backend queries.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin interface to list products and create new products or categories with image upload support.",
  "frontend/src/pages/admin/AdminSupportTicketsPage.tsx": "Admin page showing a placeholder alert explaining the demo support ticket system.",
  "frontend/src/pages/admin/AdminUpiConfigPage.tsx": "Form-based admin page for viewing and updating UPI merchant configuration via backend mutations.",
  "frontend/src/pages/CartPage.tsx": "Shows the user's cart with item management, totals, and navigation to checkout, requiring authentication.",
  "frontend/src/pages/CatalogPage.tsx": "Displays the product catalog with category, price, and search filtering plus sorting options.",
  "frontend/src/pages/CheckoutPage.tsx": "Implements a multi-step checkout flow including address entry, payment selection, and order placement.",
  "frontend/src/pages/HomePage.tsx": "Home page fetching products and categories, displaying carousels and product sections, and linking to catalog pages.",
  "frontend/src/pages/NotificationsPage.tsx": "Protected notifications page showing a placeholder card when no notifications exist.",
  "frontend/src/pages/OrderDetailPage.tsx": "Order detail page with tracking, item listing, and invoice download, requiring authentication.",
  "frontend/src/pages/OrdersPage.tsx": "Lists user orders with sorting and navigation to order details, showing placeholders when empty or loading.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays detailed product info with cart, wishlist, and rating actions, including image handling and authentication checks.",
  "frontend/src/pages/ProfilePage.tsx": "Authenticated profile page allowing users to view and update personal information.",
  "frontend/src/pages/support/FaqPage.tsx": "Public FAQ page displaying common questions with collapsible accordion items and support navigation.",
  "frontend/src/pages/support/SupportTicketDetailPage.tsx": "Authenticated page showing placeholder details for a specific support ticket.",
  "frontend/src/pages/support/SupportTicketsPage.tsx": "Authenticated page for creating and listing locally stored support tickets with a modal form.",
  "frontend/src/pages/WishlistPage.tsx": "Shows user wishlist items by mapping product IDs to product data, with empty and loading states.",
  "frontend/src/utils/copyToClipboard.ts": "Utility providing modern and legacy fallback methods to copy text to the clipboard.",
  "frontend/src/utils/detectInAppBrowser.ts": "Utility to detect in-app browsers via user-agent patterns and return a friendly browser name.",
  "frontend/src/utils/extractBackendErrorMessage.ts": "Parses various backend error shapes to extract a readable message, falling back to nested fields or stringified patterns.",
  "frontend/src/utils/guestSession.ts": "Manages a guest browsing mode using sessionStorage with methods to check, enable, and clear the state.",
  "frontend/src/utils/openExternalBrowser.ts": "Attempts to open the current URL in a new browser window and returns whether the action succeeded.",
  "frontend/src/utils/simpleAuthSession.ts": "Stores and retrieves simple session-based auth state (Google or phone) in sessionStorage, with helpers for sign-in and sign-out.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based params.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins including typography, container queries, and animations.",
  "project_state.json": "Describes the project's current state and features, focusing on replacing Internet Identity with simple Google and phone sign-in flows."
}