{
  "kind": "build_request",
  "title": "Replace Internet Identity login page with simple Google + phone sign-in UI",
  "projectName": "Meet Enterprise",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the /account/login page to remove Internet Identity-specific UI and code paths, and replace them with a simple sign-in experience offering (1) a “Continue with Google” button and (2) a phone number sign-in form.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Yes do it"
        ]
      },
      "acceptanceCriteria": [
        "Visiting /account/login does not display any mention of “Internet Identity” or “blockchain-based authentication”.",
        "AccountLoginPage.tsx no longer imports or calls useInternetIdentity().",
        "The page renders two primary options: a “Continue with Google” button and a phone number input with a clear primary action button (e.g., “Continue” / “Send code”).",
        "The existing “Continue as Guest” option remains available (or is replaced by equivalent functionality) so users can proceed without authenticating."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement frontend-only behavior for the new Google and phone sign-in options so they allow users to proceed through the app without Internet Identity, using session-based state (e.g., sessionStorage) to remember the chosen sign-in method for the current session.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Yes do it"
        ]
      },
      "acceptanceCriteria": [
        "Clicking “Continue with Google” transitions the user into an active session state and navigates them to /profile (or another clearly defined post-login destination).",
        "Submitting the phone number sign-in form transitions the user into an active session state and navigates them to /profile (or another clearly defined post-login destination).",
        "Refreshing the page preserves the active session state for the duration of the browser session.",
        "A clear sign-out action clears this session-based auth state and returns the user to a signed-out experience."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update account-related UI copy and flows to align with the new simple sign-in approach (Google/phone), including removing Internet Identity wording from the Account page and any sign-in prompts that route users to /account/login.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Yes do it"
        ]
      },
      "acceptanceCriteria": [
        "/account no longer references Internet Identity in descriptions or actions.",
        "Sign-in prompts (e.g., RequireAuth) route users to /account/login and present language consistent with the new Google/phone options.",
        "Sign-out from the account area returns the user to a signed-out state consistent with the new session-based auth behavior."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts or frontend/src/hooks/useActor.ts (immutable paths).",
    "Backend must remain a single Motoko actor in backend/main.mo.",
    "User-facing text in the updated UI must be English.",
    "Do not implement real Google OAuth or SMS/phone OTP delivery; implement UI + frontend-only session behavior only (no third-party auth integrations)."
  ],
  "nonGoals": [
    "Removing Internet Identity providers and identity plumbing from the entire app bootstrap (e.g., frontend/src/main.tsx).",
    "Implementing actual Google sign-in, OAuth flows, or SMS/OTP verification.",
    "Adding external databases or third-party authentication services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}