{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Meet Enterprise — Replace Internet Identity login with simple Google + phone session sign-in (frontend-only)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace /account/login Internet Identity UI with Google button + phone sign-in form while keeping guest access.",
      "acceptanceCriteria": [
        "Visiting /account/login does not display any mention of “Internet Identity” or “blockchain-based authentication”.",
        "AccountLoginPage.tsx no longer imports or calls useInternetIdentity().",
        "The page renders two primary options: a “Continue with Google” button and a phone number input with a clear primary action button (e.g., “Continue” / “Send code”).",
        "The existing “Continue as Guest” option remains available (or is replaced by equivalent functionality) so users can proceed without authenticating."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/account/AccountLoginPage.tsx",
          "operation": "modify",
          "description": "Remove Internet Identity-specific imports, state, and copy; implement a simple sign-in UI with (1) a primary “Continue with Google” button and (2) a phone number input + primary submit action, plus a preserved “Continue as Guest” path. Wire actions to the new session-based auth helper and navigate to the post-login destination. Use shadcn-ui components (e.g., Button, Card, Input, Label) for consistent styling; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add frontend-only session auth state for Google/phone sign-in, persisted for the browser session, with a clear sign-out that resets state.",
      "acceptanceCriteria": [
        "Clicking “Continue with Google” transitions the user into an active session state and navigates them to /profile (or another clearly defined post-login destination).",
        "Submitting the phone number sign-in form transitions the user into an active session state and navigates them to /profile (or another clearly defined post-login destination).",
        "Refreshing the page preserves the active session state for the duration of the browser session.",
        "A clear sign-out action clears this session-based auth state and returns the user to a signed-out experience."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/simpleAuthSession.ts",
          "operation": "create",
          "description": "Create a sessionStorage-backed helper for simple auth state (e.g., set/get chosen sign-in method: google/phone; optionally store phone number for the session; signOut clears stored auth method and related session data; include a small API usable by pages/components)."
        },
        {
          "path": "frontend/src/hooks/useAuthSession.ts",
          "operation": "modify",
          "description": "Extend the existing auth session hook to treat the new session-based auth state as signed-in (without requiring Internet Identity), while preserving current guest override behavior. Ensure session refresh keeps users signed in for the session when the stored method is present."
        },
        {
          "path": "frontend/src/components/auth/LoginButton.tsx",
          "operation": "modify",
          "description": "Update header login/logout behavior to use the new session-based sign-out (clear session auth state and guest session) when signed in, and route to /account/login when signed out. Use existing shadcn-ui Button styling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/account/AccountLoginPage.tsx",
          "operation": "modify",
          "description": "On “Continue with Google” and phone form submit, set session-based auth state via the new helper, clear any guest session state, and navigate to /profile. Keep behavior frontend-only (no OAuth/OTP). Use shadcn-ui form controls for the phone input; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update account pages and sign-in prompts to remove Internet Identity wording and align flows/copy with Google/phone + session sign-in, including consistent sign-out behavior.",
      "acceptanceCriteria": [
        "/account no longer references Internet Identity in descriptions or actions.",
        "Sign-in prompts (e.g., RequireAuth) route users to /account/login and present language consistent with the new Google/phone options.",
        "Sign-out from the account area returns the user to a signed-out state consistent with the new session-based auth behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/account/AccountPage.tsx",
          "operation": "modify",
          "description": "Remove Internet Identity-dependent logic and wording; derive signed-in state from the updated useAuthSession, present copy aligned to Google/phone sign-in, and implement sign-out by clearing session-based auth state (and cached queries) then navigating to a signed-out destination. Use shadcn-ui components (Card/Button) already used on the page; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/RequireAuth.tsx",
          "operation": "modify",
          "description": "Remove useInternetIdentity usage and instead rely on useAuthSession + guestSession. Update the sign-in prompt copy to reference continuing with Google/phone on /account/login, while keeping a “Continue as Guest” option. Use existing shadcn-ui components (Card/Button/Alert) for consistent UI; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/account/AccountLoginPage.tsx",
          "operation": "modify",
          "description": "Remove any remaining Internet Identity or blockchain-auth copy blocks and replace with English text describing the simple Google/phone sign-in options (UI-only). Ensure the login page experience aligns with RequireAuth and Account page prompts. Use existing shadcn-ui Card typography components; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}