{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Meet Enterprise — Simulated email + 4-digit code sign-in flow on /account/login",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace the Google/phone login UI (within the two specified DOM elements only) with a multi-step email → simulated code → verify → details (name/address/phone) flow.",
      "acceptanceCriteria": [
        "On /account/login, within the selected container element, the UI is a multi-step flow with at least: email entry, code generation/display, code entry/verification, and required details entry (name/address/phone).",
        "The simulated code is a 4-digit numeric value that is displayed on-screen (no email sending).",
        "The flow has clear primary/secondary actions (e.g., Send code, Verify, Resend code, Back/Edit email, Complete sign-in) and the rest of the page outside the selected elements is not changed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/EmailCodeSignInFlow.tsx",
          "operation": "create",
          "description": "Create a self-contained, client-only multi-step sign-in component (Step 1: email entry; Step 2: generate and display a simulated 4-digit code in-app; Step 3: code entry + verify; Step 4: collect required details name/address/phone). Compose existing shadcn/ui components (Button/Input/Label/Card content patterns) without modifying any files under frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/account/AccountLoginPage.tsx",
          "operation": "modify",
          "description": "Update ONLY the two specified DOM elements on /account/login by replacing the current Google sign-in button area with the new EmailCodeSignInFlow component (leaving all other page sections/structure unchanged), so the new flow renders entirely inside the selected container element; ensure the selected SVG element is no longer Google-branded and aligns with the email/code flow. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add inline validation, resend behavior, and user-facing English error handling for email, code verification, and required profile fields—without leaving the page.",
      "acceptanceCriteria": [
        "Submitting an empty or invalid email shows an inline error and does not proceed to code verification.",
        "Entering a wrong 4-digit code shows an error (e.g., \"Incorrect code. Try again.\") and keeps the user on the code-entry step.",
        "Name, address, and phone are required; missing/invalid values show field-level errors and block completion until corrected.",
        "A user can request a new simulated code (resend) which generates a new code and invalidates the previous one."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/EmailCodeSignInFlow.tsx",
          "operation": "modify",
          "description": "Implement validation and error states for: invalid/empty email, incorrect code, and missing/invalid name/address/phone; show inline English error messages; support resend code (generate a new 4-digit code and invalidate the prior code); allow Back/Edit email and retry without navigating away. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "On successful verification + details submission, sign the user in via the existing session mechanism, clear guest mode, refresh React Query caches, and redirect to /profile (or current post-login destination).",
      "acceptanceCriteria": [
        "After successful completion, guest mode (if enabled) is cleared and the app considers the user signed in for the current session.",
        "The user is redirected to the next page (existing behavior: /profile) and the UI no longer shows the login step.",
        "React Query caches are invalidated/refreshed similarly to the existing login behavior so authenticated-only pages load without requiring a manual refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/simpleAuthSession.ts",
          "operation": "modify",
          "description": "Extend the existing session-based auth helper to support an email-based auth method (in addition to current google/phone) and store the verified email plus collected profile details (name/address/phone) in sessionStorage for the session, while preserving existing behavior for other methods."
        },
        {
          "path": "frontend/src/components/auth/EmailCodeSignInFlow.tsx",
          "operation": "modify",
          "description": "On completion: clear any active guest session, mark the user signed in using the existing session-based mechanism (simpleAuthSession), invalidate/refresh React Query caches (using QueryClient) similarly to current login behavior, and navigate to the existing post-login destination (/profile). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Replace the selected SVG icon on /account/login to match email/code verification and remove any Google branding; ensure correct rendering in light/dark themes.",
      "acceptanceCriteria": [
        "The selected SVG no longer displays a Google-branded icon.",
        "The icon matches the email/code verification concept and renders correctly across light/dark themes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/account/AccountLoginPage.tsx",
          "operation": "modify",
          "description": "Within the selected SVG element only, replace the Google-branded icon (currently rendered via the Google icon component) with an email/code verification-themed SVG icon (e.g., mail/lock/check) consistent with the updated flow; ensure it uses current theme-driven colors so it renders correctly in light/dark. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}